

n = int(input())
arr = []
for _ in range(n):
    arr.append(int(input()))
arr_max = max(arr)
dp = [1]*(arr_max+1)

for i in range(2, arr_max+1):
    dp[i] += dp[i - 2]

for i in range(3, arr_max+1):
    dp[i] += dp[i - 3]

# 2의배수*1이면 1개 2*2면 2개
# 3의배수*1이면 1개 3*2면 2개
for i in arr:
    print(dp[i])


# 1, 2 ,3 ,4 ,6, 8,  14

# 1 1 2 3 4 6 8 11 15



# 1 1 1 1 1 1 1 1 1 1 1 1  전부 1씩 갖고있을때 1개는 무조건있으니까,
# 1일때 1 개 2일때 1+1개 3일때 1+1+1개 4일때 1+1+2개 5일때 1+2+
# 6일떈 2개더해졌어, 8갠데,,, 4일때4랑 + 3일때 3
# 2 4 6 8 10 12 14 16 ,, 2의배수일때,,는
# 4면 2일때랑 1111 112 22 13
# 6이면 4일때랑 이제 3 2개들어갈때